xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/random_image_app.c
#include "random_image_app.h"

#include <dirent.h>
#include <errno.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h>
#include <sys/stat.h>

#include "driver/gpio.h"
#include "esp_check.h"
#include "esp_crt_bundle.h"
#include "esp_event.h"
#include "esp_heap_caps.h"
#include "esp_http_client.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "esp32_s3_szp.h"
#include "freertos/event_groups.h"
#include "freertos/task.h"
#include "jpeg_decoder.h"

#define LCD_W BSP_LCD_H_RES
#define LCD_H BSP_LCD_V_RES
#define IMAGE_TOP 40
#define IMAGE_H (LCD_H - IMAGE_TOP)

#define WIFI_CONNECTED_BIT BIT0
#define WIFI_FAIL_BIT BIT1

#define SD_APP_DIR SD_MOUNT_POINT "/szpi"
#define SD_CONFIG_DIR SD_APP_DIR "/config"
#define SD_CACHE_DIR SD_APP_DIR "/cache"
#define SD_RANDOM_CACHE_DIR SD_CACHE_DIR "/random"
#define SD_WIFI_CONFIG_PATH SD_CONFIG_DIR "/wifi.ini"
#define SD_RANDOM_LATEST_PATH SD_RANDOM_CACHE_DIR "/latest.jpg"

typedef struct {
    uint8_t *data;
    size_t len;
    size_t cap;
    size_t max_len;
    int total_timeout_ms;
    int64_t start_us;
    int64_t last_progress_us;
    size_t last_progress_len;
    const char *progress_prefix;
} http_buffer_t;

static const char *TAG = "random_lvgl";

LV_FONT_DECLARE(font_alipuhui20);
extern int icon_flag;

static lv_obj_t *s_page;
static lv_obj_t *s_image;
static lv_obj_t *s_title_bar;
static lv_obj_t *s_status_label;
static lv_obj_t *s_spinner;
static lv_img_dsc_t s_image_dsc;
static uint8_t *s_image_buf;
static bool s_chrome_visible = true;
static bool s_status_loading;

static EventGroupHandle_t s_wifi_event_group;
static bool s_wifi_started;
static int s_retry_num;
static volatile bool s_fetching;
static bool s_button_task_started;

static char s_wifi_ssid[33] = CONFIG_RANDOM_IMAGE_WIFI_SSID;
static char s_wifi_password[65] = CONFIG_RANDOM_IMAGE_WIFI_PASSWORD;
static char s_api_url[256] = CONFIG_RANDOM_IMAGE_API_URL;

static void random_image_start_refresh(void);

static void trim_ascii(char *text)
{
    char *start = text;
    while (*start == ' ' || *start == '\t' || *start == '\r' || *start == '\n') {
        start++;
    }

    if (start != text) {
        memmove(text, start, strlen(start) + 1);
    }

    size_t len = strlen(text);
    while (len > 0) {
        char c = text[len - 1];
        if (c != ' ' && c != '\t' && c != '\r' && c != '\n') {
            break;
        }
        text[--len] = '\0';
    }
}

static void mkdir_if_missing(const char *path)
{
    if (mkdir(path, 0775) != 0 && errno != EEXIST) {
        ESP_LOGW(TAG, "mkdir %s failed: errno=%d", path, errno);
    }
}

static bool sdcard_prepare(void)
{
    esp_err_t ret = bsp_sdcard_mount();
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "TF mount failed: %s", esp_err_to_name(ret));
        return false;
    }

    mkdir_if_missing(SD_APP_DIR);
    mkdir_if_missing(SD_CONFIG_DIR);
    mkdir_if_missing(SD_CACHE_DIR);
    mkdir_if_missing(SD_RANDOM_CACHE_DIR);
    return true;
}

static void write_wifi_template(void)
{
    FILE *existing = fopen(SD_WIFI_CONFIG_PATH, "r");
    if (existing != NULL) {
        fclose(existing);
        return;
    }

    FILE *f = fopen(SD_WIFI_CONFIG_PATH, "w");
    if (f == NULL) {
        ESP_LOGW(TAG, "cannot create %s", SD_WIFI_CONFIG_PATH);
        return;
    }

    fprintf(f,
            "# SZPI-S3 LVGL config\n"
            "# Edit on your computer, then reboot the board.\n"
            "ssid=%s\n"
            "password=%s\n"
            "api_url=%s\n",
            s_wifi_ssid, s_wifi_password, s_api_url);
    fclose(f);
}

static void load_sd_config(void)
{
    if (!sdcard_prepare()) {
        return;
    }

    FILE *f = fopen(SD_WIFI_CONFIG_PATH, "r");
    if (f == NULL) {
        write_wifi_template();
        return;
    }

    char line[384];
    while (fgets(line, sizeof(line), f) != NULL) {
        trim_ascii(line);
        if (line[0] == '\0' || line[0] == '#' || line[0] == ';') {
            continue;
        }

        char *eq = strchr(line, '=');
        if (eq == NULL) {
            continue;
        }
        *eq = '\0';
        char *key = line;
        char *value = eq + 1;
        trim_ascii(key);
        trim_ascii(value);

        if (strcasecmp(key, "ssid") == 0) {
            snprintf(s_wifi_ssid, sizeof(s_wifi_ssid), "%s", value);
        } else if (strcasecmp(key, "password") == 0 || strcasecmp(key, "psk") == 0) {
            snprintf(s_wifi_password, sizeof(s_wifi_password), "%s", value);
        } else if (strcasecmp(key, "api_url") == 0 || strcasecmp(key, "random_image_url") == 0) {
            snprintf(s_api_url, sizeof(s_api_url), "%s", value);
        }
    }
    fclose(f);

    ESP_LOGI(TAG, "config ssid=%s api=%s", s_wifi_ssid, s_api_url);
}

static esp_err_t write_file_bytes(const char *path, const uint8_t *data, size_t len)
{
    if (!sdcard_prepare()) {
        return ESP_ERR_INVALID_STATE;
    }

    FILE *f = fopen(path, "wb");
    if (f == NULL) {
        return ESP_FAIL;
    }
    size_t written = fwrite(data, 1, len, f);
    int close_ret = fclose(f);
    return (written == len && close_ret == 0) ? ESP_OK : ESP_FAIL;
}

static esp_err_t read_file_to_buffer(const char *path, size_t max_len, http_buffer_t *out)
{
    memset(out, 0, sizeof(*out));
    FILE *f = fopen(path, "rb");
    if (f == NULL) {
        return ESP_ERR_NOT_FOUND;
    }

    if (fseek(f, 0, SEEK_END) != 0) {
        fclose(f);
        return ESP_FAIL;
    }

    long file_len = ftell(f);
    rewind(f);
    if (file_len <= 0 || (size_t)file_len > max_len) {
        fclose(f);
        return ESP_ERR_INVALID_SIZE;
    }

    out->data = heap_caps_malloc((size_t)file_len + 1, MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
    if (out->data == NULL) {
        fclose(f);
        return ESP_ERR_NO_MEM;
    }

    size_t got = fread(out->data, 1, (size_t)file_len, f);
    fclose(f);
    if (got != (size_t)file_len) {
        heap_caps_free(out->data);
        memset(out, 0, sizeof(*out));
        return ESP_FAIL;
    }

    out->len = got;
    out->cap = got;
    out->max_len = max_len;
    out->data[out->len] = '\0';
    return ESP_OK;
}

static void ui_apply_chrome_state(void)
{
    if (s_title_bar != NULL) {
        if (s_chrome_visible) {
            lv_obj_clear_flag(s_title_bar, LV_OBJ_FLAG_HIDDEN);
        } else {
            lv_obj_add_flag(s_title_bar, LV_OBJ_FLAG_HIDDEN);
        }
    }

    if (s_status_label != NULL) {
        if (s_chrome_visible) {
            lv_obj_clear_flag(s_status_label, LV_OBJ_FLAG_HIDDEN);
        } else {
            lv_obj_add_flag(s_status_label, LV_OBJ_FLAG_HIDDEN);
        }
    }

