xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/random_image_app.c
    if (s_spinner != NULL) {
        if (s_status_loading) {
            lv_obj_clear_flag(s_spinner, LV_OBJ_FLAG_HIDDEN);
        } else {
            lv_obj_add_flag(s_spinner, LV_OBJ_FLAG_HIDDEN);
        }
    }
}

static void ui_set_status_locked(const char *text, bool loading)
{
    lvgl_port_lock(0);
    s_status_loading = loading;
    if (s_page != NULL && s_status_label != NULL) {
        lv_label_set_text(s_status_label, text);
    }
    ui_apply_chrome_state();
    lvgl_port_unlock();
}

static void ui_set_status_unlocked(const char *text, bool loading)
{
    s_status_loading = loading;
    if (s_status_label != NULL) {
        lv_label_set_text(s_status_label, text);
    }
    ui_apply_chrome_state();
}

static void ui_show_image_locked(uint16_t *canvas)
{
    lvgl_port_lock(0);
    if (s_page != NULL && s_image != NULL) {
        uint8_t *old_buf = s_image_buf;
        lv_img_set_src(s_image, NULL);

        s_image_buf = (uint8_t *)canvas;
        s_image_dsc.header.cf = LV_IMG_CF_TRUE_COLOR;
        s_image_dsc.header.always_zero = 0;
        s_image_dsc.header.reserved = 0;
        s_image_dsc.header.w = LCD_W;
        s_image_dsc.header.h = LCD_H;
        s_image_dsc.data_size = LCD_W * LCD_H * sizeof(uint16_t);
        s_image_dsc.data = s_image_buf;

        lv_img_set_src(s_image, &s_image_dsc);
        lv_obj_move_background(s_image);
        if (s_status_label != NULL) {
            lv_label_set_text(s_status_label, "Ready");
        }
        s_status_loading = false;
        ui_apply_chrome_state();

        if (old_buf != NULL) {
            heap_caps_free(old_buf);
        }
    } else {
        heap_caps_free(canvas);
    }
    lvgl_port_unlock();
}

static void wifi_event_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        esp_wifi_connect();
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        if (s_retry_num < 5) {
            esp_wifi_connect();
            s_retry_num++;
        } else if (s_wifi_event_group != NULL) {
            xEventGroupSetBits(s_wifi_event_group, WIFI_FAIL_BIT);
        }
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *event = (ip_event_got_ip_t *)event_data;
        ESP_LOGI(TAG, "got ip:" IPSTR, IP2STR(&event->ip_info.ip));
        s_retry_num = 0;
        if (s_wifi_event_group != NULL) {
            xEventGroupSetBits(s_wifi_event_group, WIFI_CONNECTED_BIT);
        }
    }
}

static esp_err_t wifi_connect_sta(void)
{
    if (strlen(s_wifi_ssid) == 0) {
        ESP_LOGW(TAG, "WiFi SSID is empty");
        return ESP_ERR_INVALID_STATE;
    }

    if (s_wifi_started) {
        EventBits_t current = xEventGroupGetBits(s_wifi_event_group);
        if (current & WIFI_CONNECTED_BIT) {
            return ESP_OK;
        }

        xEventGroupClearBits(s_wifi_event_group, WIFI_CONNECTED_BIT | WIFI_FAIL_BIT);
        s_retry_num = 0;
        esp_wifi_connect();
        EventBits_t bits = xEventGroupWaitBits(s_wifi_event_group,
                                               WIFI_CONNECTED_BIT | WIFI_FAIL_BIT,
                                               pdFALSE,
                                               pdFALSE,
                                               pdMS_TO_TICKS(20000));
        return (bits & WIFI_CONNECTED_BIT) ? ESP_OK : ESP_FAIL;
    }

    esp_err_t ret = esp_netif_init();
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        return ret;
    }

    ret = esp_event_loop_create_default();
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        return ret;
    }

    s_wifi_event_group = xEventGroupCreate();
    if (s_wifi_event_group == NULL) {
        return ESP_ERR_NO_MEM;
    }

    esp_netif_create_default_wifi_sta();

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ret = esp_wifi_init(&cfg);
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        return ret;
    }

    ESP_RETURN_ON_ERROR(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, wifi_event_handler, NULL, NULL),
                        TAG, "register wifi event failed");
    ESP_RETURN_ON_ERROR(esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP, wifi_event_handler, NULL, NULL),
                        TAG, "register ip event failed");

    wifi_config_t wifi_config = { 0 };
    size_t ssid_len = strnlen(s_wifi_ssid, sizeof(wifi_config.sta.ssid));
    size_t password_len = strnlen(s_wifi_password, sizeof(wifi_config.sta.password));
    memcpy(wifi_config.sta.ssid, s_wifi_ssid, ssid_len);
    memcpy(wifi_config.sta.password, s_wifi_password, password_len);
    wifi_config.sta.threshold.authmode = strlen(s_wifi_password) == 0 ? WIFI_AUTH_OPEN : WIFI_AUTH_WPA2_PSK;
    wifi_config.sta.sae_pwe_h2e = WPA3_SAE_PWE_BOTH;

    ESP_RETURN_ON_ERROR(esp_wifi_set_mode(WIFI_MODE_STA), TAG, "set wifi mode failed");
    ESP_RETURN_ON_ERROR(esp_wifi_set_config(WIFI_IF_STA, &wifi_config), TAG, "set wifi config failed");

    ret = esp_wifi_start();
    if (ret != ESP_OK && ret != ESP_ERR_WIFI_CONN) {
        return ret;
    }
    s_wifi_started = true;

    EventBits_t bits = xEventGroupWaitBits(s_wifi_event_group,
                                           WIFI_CONNECTED_BIT | WIFI_FAIL_BIT,
                                           pdFALSE,
                                           pdFALSE,
                                           pdMS_TO_TICKS(20000));
    return (bits & WIFI_CONNECTED_BIT) ? ESP_OK : ESP_FAIL;
}

static esp_err_t append_http_data(http_buffer_t *buf, const uint8_t *data, size_t data_len)
{
    size_t new_len = buf->len + data_len;
    if (new_len > buf->max_len) {
        return ESP_ERR_INVALID_SIZE;
    }

    if (new_len > buf->cap) {
        size_t new_cap = buf->cap == 0 ? 4096 : buf->cap;
        while (new_cap < new_len) {
            new_cap *= 2;
        }
        if (new_cap > buf->max_len) {
            new_cap = buf->max_len;
        }

        uint8_t *new_data = heap_caps_realloc(buf->data, new_cap + 1, MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
        if (new_data == NULL) {
            return ESP_ERR_NO_MEM;
        }
        buf->data = new_data;
        buf->cap = new_cap;
    }

    memcpy(buf->data + buf->len, data, data_len);
    buf->len = new_len;
    buf->data[buf->len] = '\0';
    return ESP_OK;
}

static void update_download_progress(http_buffer_t *buf)
{
    int64_t now_us = esp_timer_get_time();
    if (buf->progress_prefix == NULL ||
        (now_us - buf->last_progress_us <= 1000000 && buf->len - buf->last_progress_len < 64 * 1024)) {
        return;
    }

