xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/random_image_app.c
    char text[32];
    snprintf(text, sizeof(text), "%s %u KB", buf->progress_prefix, (unsigned)(buf->len / 1024));
    ui_set_status_locked(text, true);
    buf->last_progress_us = now_us;
    buf->last_progress_len = buf->len;
}

static esp_err_t http_get_to_buffer(const char *url, size_t max_len, const char *progress_prefix,
                                    int total_timeout_ms, http_buffer_t *out)
{
    memset(out, 0, sizeof(*out));
    out->max_len = max_len;
    out->total_timeout_ms = total_timeout_ms;
    out->start_us = esp_timer_get_time();
    out->progress_prefix = progress_prefix;

    esp_http_client_config_t config = {
        .url = url,
        .crt_bundle_attach = esp_crt_bundle_attach,
        .timeout_ms = CONFIG_RANDOM_IMAGE_HTTP_TIMEOUT_MS,
        .buffer_size = 4096,
        .buffer_size_tx = 1024,
        .keep_alive_enable = false,
        .max_redirection_count = 5,
        .addr_type = HTTP_ADDR_TYPE_INET,
    };

    esp_http_client_handle_t client = esp_http_client_init(&config);
    if (client == NULL) {
        return ESP_ERR_NO_MEM;
    }

    esp_http_client_set_header(client, "Accept", "image/jpeg,*/*");
    esp_http_client_set_header(client, "Accept-Encoding", "identity");
    esp_http_client_set_header(client, "Connection", "close");

    esp_err_t ret = esp_http_client_open(client, 0);
    if (ret != ESP_OK) {
        esp_http_client_cleanup(client);
        return ret;
    }

    int content_len = esp_http_client_fetch_headers(client);
    int status = esp_http_client_get_status_code(client);
    ESP_LOGI(TAG, "GET status=%d content_length=%d", status, content_len);

    if (status < 200 || status >= 300) {
        ret = ESP_FAIL;
        goto cleanup;
    }
    if (content_len > 0 && (size_t)content_len > max_len) {
        ret = ESP_ERR_INVALID_SIZE;
        goto cleanup;
    }

    uint8_t read_buf[4096];
    while (true) {
        int64_t now_us = esp_timer_get_time();
        if (total_timeout_ms > 0 && now_us - out->start_us > (int64_t)total_timeout_ms * 1000) {
            ret = ESP_ERR_TIMEOUT;
            goto cleanup;
        }

        int read_len = esp_http_client_read(client, (char *)read_buf, sizeof(read_buf));
        if (read_len < 0) {
            if (read_len == -ESP_ERR_HTTP_EAGAIN) {
                vTaskDelay(pdMS_TO_TICKS(50));
                continue;
            }
            ret = ESP_FAIL;
            goto cleanup;
        }
        if (read_len == 0) {
            if (esp_http_client_is_complete_data_received(client)) {
                ret = ESP_OK;
                break;
            }
            vTaskDelay(pdMS_TO_TICKS(50));
            continue;
        }

        ret = append_http_data(out, read_buf, (size_t)read_len);
        if (ret != ESP_OK) {
            goto cleanup;
        }
        update_download_progress(out);

        if (content_len > 0 && out->len >= (size_t)content_len) {
            ret = ESP_OK;
            break;
        }
    }

    if (out->len == 0) {
        ret = ESP_FAIL;
    }

cleanup:
    esp_http_client_close(client);
    esp_http_client_cleanup(client);
    if (ret != ESP_OK) {
        heap_caps_free(out->data);
        memset(out, 0, sizeof(*out));
    }
    return ret;
}

static esp_jpeg_image_scale_t choose_jpeg_scale(int width, int height)
{
    if (width / 8 >= LCD_W && height / 8 >= LCD_H) {
        return JPEG_IMAGE_SCALE_1_8;
    }
    if (width / 4 >= LCD_W && height / 4 >= LCD_H) {
        return JPEG_IMAGE_SCALE_1_4;
    }
    if (width / 2 >= LCD_W && height / 2 >= LCD_H) {
        return JPEG_IMAGE_SCALE_1_2;
    }
    return JPEG_IMAGE_SCALE_0;
}

static uint16_t *center_crop_canvas(const uint16_t *pixels, int width, int height)
{
    uint16_t *canvas = heap_caps_malloc(LCD_W * LCD_H * sizeof(uint16_t), MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
    if (canvas == NULL) {
        return NULL;
    }

    memset(canvas, 0, LCD_W * LCD_H * sizeof(uint16_t));

    int src_x = width > LCD_W ? (width - LCD_W) / 2 : 0;
    int src_y = height > LCD_H ? (height - LCD_H) / 2 : 0;
    int copy_w = width > LCD_W ? LCD_W : width;
    int copy_h = height > LCD_H ? LCD_H : height;
    int dst_x = width < LCD_W ? (LCD_W - width) / 2 : 0;
    int dst_y = height < LCD_H ? (LCD_H - height) / 2 : 0;

    for (int y = 0; y < copy_h; y++) {
        const uint16_t *src = pixels + (src_y + y) * width + src_x;
        uint16_t *dst = canvas + (dst_y + y) * LCD_W + dst_x;
        memcpy(dst, src, copy_w * sizeof(uint16_t));
    }

    return canvas;
}

static esp_err_t decode_jpeg_to_lvgl(const http_buffer_t *jpeg)
{
    esp_jpeg_image_cfg_t info_cfg = {
        .indata = jpeg->data,
        .indata_size = jpeg->len,
        .out_format = JPEG_IMAGE_FORMAT_RGB565,
        .out_scale = JPEG_IMAGE_SCALE_0,
        .flags = {
            .swap_color_bytes = 1,
        },
    };
    esp_jpeg_image_output_t original = { 0 };
    ESP_RETURN_ON_ERROR(esp_jpeg_get_image_info(&info_cfg, &original), TAG, "read jpeg info failed");

    info_cfg.out_scale = choose_jpeg_scale(original.width, original.height);

    esp_jpeg_image_output_t outimg = { 0 };
    ESP_RETURN_ON_ERROR(esp_jpeg_get_image_info(&info_cfg, &outimg), TAG, "read scaled jpeg info failed");

    uint16_t *decoded = heap_caps_malloc(outimg.output_len, MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
    ESP_RETURN_ON_FALSE(decoded != NULL, ESP_ERR_NO_MEM, TAG, "no memory for decoded image");

    esp_jpeg_image_cfg_t jpeg_cfg = info_cfg;
    jpeg_cfg.outbuf = (uint8_t *)decoded;
    jpeg_cfg.outbuf_size = outimg.output_len;

    esp_err_t ret = esp_jpeg_decode(&jpeg_cfg, &outimg);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "decoded image %dx%d -> %dx%d, %u bytes",
                 original.width, original.height, outimg.width, outimg.height, (unsigned)outimg.output_len);
        uint16_t *canvas = center_crop_canvas(decoded, outimg.width, outimg.height);
        if (canvas == NULL) {
            ret = ESP_ERR_NO_MEM;
        } else {
            ui_show_image_locked(canvas);
        }
    }

    heap_caps_free(decoded);
    return ret;
}

