xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/random_image_app.c
static esp_err_t show_cached_image(void)
{
    http_buffer_t cached = { 0 };
    esp_err_t ret = read_file_to_buffer(SD_RANDOM_LATEST_PATH, CONFIG_RANDOM_IMAGE_MAX_JPEG_KB * 1024, &cached);
    if (ret != ESP_OK) {
        return ret;
    }

    ui_set_status_locked("Decode cache", true);
    ret = decode_jpeg_to_lvgl(&cached);
    heap_caps_free(cached.data);
    return ret;
}

static esp_err_t fetch_and_show_random_image(void)
{
    esp_err_t ret = ESP_FAIL;

    for (int attempt = 1; attempt <= CONFIG_RANDOM_IMAGE_FETCH_RETRIES; attempt++) {
        http_buffer_t jpeg = { 0 };
        ui_set_status_locked(attempt == 1 ? "Download image" : "Retry image", true);

        ret = http_get_to_buffer(s_api_url, CONFIG_RANDOM_IMAGE_MAX_JPEG_KB * 1024, "Download",
                                 CONFIG_RANDOM_IMAGE_IMAGE_TIMEOUT_MS, &jpeg);
        if (ret == ESP_OK) {
            esp_err_t cache_ret = write_file_bytes(SD_RANDOM_LATEST_PATH, jpeg.data, jpeg.len);
            if (cache_ret != ESP_OK) {
                ESP_LOGW(TAG, "cache failed: %s", esp_err_to_name(cache_ret));
            }

            ui_set_status_locked("Decode image", true);
            ret = decode_jpeg_to_lvgl(&jpeg);
        }

        heap_caps_free(jpeg.data);
        if (ret == ESP_OK) {
            return ESP_OK;
        }
        ESP_LOGW(TAG, "attempt %d/%d failed: %s", attempt, CONFIG_RANDOM_IMAGE_FETCH_RETRIES, esp_err_to_name(ret));
    }

    ui_set_status_locked("Try cache", true);
    esp_err_t cached_ret = show_cached_image();
    return cached_ret == ESP_OK ? ESP_OK : ret;
}

static void random_fetch_task(void *arg)
{
    load_sd_config();

    ui_set_status_locked("Connect WiFi", true);
    esp_err_t ret = wifi_connect_sta();
    if (ret == ESP_OK) {
        ret = fetch_and_show_random_image();
    } else {
        ESP_LOGW(TAG, "wifi connect failed: %s", esp_err_to_name(ret));
        ui_set_status_locked("WiFi failed, try cache", true);
        if (show_cached_image() == ESP_OK) {
            ret = ESP_OK;
        }
    }

    if (ret != ESP_OK) {
        ui_set_status_locked("Refresh failed", false);
    }

    s_fetching = false;
    vTaskDelete(NULL);
}

static void random_image_start_refresh(void)
{
    if (s_fetching) {
        return;
    }

    s_fetching = true;
    BaseType_t ok = xTaskCreatePinnedToCore(random_fetch_task, "random_image", 12288, NULL, 4, NULL, 1);
    if (ok != pdPASS) {
        s_fetching = false;
        ESP_LOGE(TAG, "create random_image task failed");
    }
}

static void random_button_task(void *arg)
{
    gpio_num_t key_gpio = CONFIG_RANDOM_IMAGE_REFRESH_GPIO;
    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << key_gpio,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&io_conf);

    int last_level = 1;
    int64_t press_start_us = 0;

    while (true) {
        int level = gpio_get_level(key_gpio);
        int64_t now_us = esp_timer_get_time();
        if (last_level == 1 && level == 0) {
            press_start_us = now_us;
        } else if (last_level == 0 && level == 1 && press_start_us > 0) {
            if (now_us - press_start_us > 30000 && s_page != NULL) {
                random_image_start_refresh();
            }
            press_start_us = 0;
        }
        last_level = level;
        vTaskDelay(pdMS_TO_TICKS(20));
    }
}

static void ensure_button_task(void)
{
    if (s_button_task_started) {
        return;
    }

    if (xTaskCreatePinnedToCore(random_button_task, "random_key", 4096, NULL, 5, NULL, 0) == pdPASS) {
        s_button_task_started = true;
    }
}

static void random_back_cb(lv_event_t *e)
{
    if (s_page != NULL) {
        lv_obj_del(s_page);
        s_page = NULL;
        s_image = NULL;
        s_title_bar = NULL;
        s_status_label = NULL;
        s_spinner = NULL;
    }
    icon_flag = 0;
}

static void random_refresh_cb(lv_event_t *e)
{
    ui_set_status_unlocked("Refreshing", true);
    random_image_start_refresh();
}

static void random_toggle_chrome_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED) {
        return;
    }

    s_chrome_visible = !s_chrome_visible;
    ui_apply_chrome_state();
}

static void random_page_gesture_cb(lv_event_t *e)
{
    lv_indev_t *indev = lv_indev_get_act();
    if (indev == NULL) {
        return;
    }

    lv_dir_t dir = lv_indev_get_gesture_dir(indev);
    if (dir == LV_DIR_RIGHT) {
        random_back_cb(e);
    } else if (dir == LV_DIR_LEFT || dir == LV_DIR_TOP || dir == LV_DIR_BOTTOM) {
        ui_set_status_unlocked("Refreshing", true);
        random_image_start_refresh();
    }
}

void random_image_app_event_handler(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED) {
        return;
    }

    if (s_page != NULL) {
        lv_obj_del(s_page);
    }
    icon_flag = 7;
    s_chrome_visible = true;
    s_status_loading = false;

    s_page = lv_obj_create(lv_scr_act());
    lv_obj_set_size(s_page, LCD_W, LCD_H);
    lv_obj_set_style_pad_all(s_page, 0, 0);
    lv_obj_set_style_border_width(s_page, 0, 0);
    lv_obj_set_style_radius(s_page, 0, 0);
    lv_obj_set_style_bg_color(s_page, lv_color_hex(0x101820), 0);
    lv_obj_add_event_cb(s_page, random_page_gesture_cb, LV_EVENT_GESTURE, NULL);

    s_image = lv_img_create(s_page);
    lv_obj_set_size(s_image, LCD_W, LCD_H);
    lv_obj_align(s_image, LV_ALIGN_CENTER, 0, 0);
    lv_obj_add_flag(s_image, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(s_image, random_toggle_chrome_cb, LV_EVENT_CLICKED, NULL);
    if (s_image_buf != NULL) {
        lv_img_set_src(s_image, &s_image_dsc);
        lv_obj_move_background(s_image);
    }

    s_title_bar = lv_obj_create(s_page);
    lv_obj_set_size(s_title_bar, LCD_W, IMAGE_TOP);
    lv_obj_align(s_title_bar, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_pad_all(s_title_bar, 0, 0);
    lv_obj_set_style_radius(s_title_bar, 0, 0);
    lv_obj_set_style_border_width(s_title_bar, 0, 0);
    lv_obj_set_style_bg_color(s_title_bar, lv_color_hex(0x111820), 0);
    lv_obj_set_style_bg_opa(s_title_bar, LV_OPA_80, 0);

