xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/random_image_app.c
    lv_obj_t *back = lv_btn_create(s_title_bar);
    lv_obj_set_size(back, 52, 34);
    lv_obj_align(back, LV_ALIGN_LEFT_MID, 2, 0);
    lv_obj_set_style_bg_opa(back, LV_OPA_TRANSP, 0);
    lv_obj_set_style_shadow_opa(back, LV_OPA_TRANSP, 0);
    lv_obj_add_event_cb(back, random_back_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *back_label = lv_label_create(back);
    lv_label_set_text(back_label, LV_SYMBOL_LEFT);
    lv_obj_set_style_text_font(back_label, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(back_label, lv_color_hex(0xffffff), 0);
    lv_obj_center(back_label);

    lv_obj_t *title_label = lv_label_create(s_title_bar);
    lv_label_set_text(title_label, "Random Image");
    lv_obj_set_style_text_font(title_label, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(title_label, lv_color_hex(0xffffff), 0);
    lv_obj_align(title_label, LV_ALIGN_CENTER, 0, 0);

    lv_obj_t *refresh = lv_btn_create(s_title_bar);
    lv_obj_set_size(refresh, 52, 34);
    lv_obj_align(refresh, LV_ALIGN_RIGHT_MID, -2, 0);
    lv_obj_set_style_bg_opa(refresh, LV_OPA_TRANSP, 0);
    lv_obj_set_style_shadow_opa(refresh, LV_OPA_TRANSP, 0);
    lv_obj_add_event_cb(refresh, random_refresh_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *refresh_label = lv_label_create(refresh);
    lv_label_set_text(refresh_label, LV_SYMBOL_REFRESH);
    lv_obj_set_style_text_font(refresh_label, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(refresh_label, lv_color_hex(0xffffff), 0);
    lv_obj_center(refresh_label);

    s_status_label = lv_label_create(s_page);
    lv_label_set_text(s_status_label, "Ready");
    lv_obj_set_style_text_font(s_status_label, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(s_status_label, lv_color_hex(0xffffff), 0);
    lv_obj_set_style_bg_color(s_status_label, lv_color_hex(0x111820), 0);
    lv_obj_set_style_bg_opa(s_status_label, LV_OPA_70, 0);
    lv_obj_set_style_pad_left(s_status_label, 8, 0);
    lv_obj_set_style_pad_right(s_status_label, 8, 0);
    lv_obj_set_style_pad_top(s_status_label, 3, 0);
    lv_obj_set_style_pad_bottom(s_status_label, 3, 0);
    lv_obj_align(s_status_label, LV_ALIGN_BOTTOM_MID, 0, -8);

    s_spinner = lv_spinner_create(s_page, 1000, 60);
    lv_obj_set_size(s_spinner, 44, 44);
    lv_obj_center(s_spinner);
    ui_apply_chrome_state();

    ensure_button_task();
    ui_set_status_unlocked("Refreshing", true);
    random_image_start_refresh();
}
